# Задача 1. Постройте график функции 𝑓(𝑥)=5𝑥^2+10𝑥−30
# По графику определите, при каких значения x значение функции отрицательно.

import matplotlib.pyplot as mat

a = 5
b =  10
c = -30
x = list(i for i in range(-6, 5))
F_x = []
for i in range(len(x)):
    F_x.append(a*(x[i]*x[i]) + b*x[i] + c)

mat.plot(x, F_x, "r-")
mat.show()

print("Значения функции отрицательны в промежутке при х, принадлежащем к промежутку [-3,6; 1,6]")
